public class Main {
    public static void main(String[] args) {

       int ticketCost = 15000;
       int bonus = 20;
       int totalBonus = ticketCost/bonus;

       System.out.println("Всего бонусов начисленно: " +totalBonus);
       // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}